## Laoding Data

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

ModuleNotFoundError: No module named 'pandas'

In [ ]:
# Load Dataset

df = pd.read_csv("S:\FALL 2025\ADT\Final Project\data\realtor-data.zip.csv")

In [4]:
df.head()

,brokered_by,status,price,bed,bath,acre_lot,street,city,state,zip_code,house_size,prev_sold_date
0,103378.0,for_sale,105000.0,3.0,2.0,0.12,1962661.0,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,52707.0,for_sale,80000.0,4.0,2.0,0.08,1902874.0,Adjuntas,Puerto Rico,601.0,1527.0,NaN
2,103379.0,for_sale,67000.0,2.0,1.0,0.15,1404990.0,Juana Diaz,Puerto Rico,795.0,748.0,NaN
3,31239.0,for_sale,145000.0,4.0,2.0,0.10,1947675.0,Ponce,Puerto Rico,731.0,1800.0,NaN
4,34632.0,for_sale,65000.0,6.0,2.0,0.05,331151.0,Mayaguez,Puerto Rico,680.0,NaN,NaN

In [5]:
df.tail()

,brokered_by,status,price,bed,bath,acre_lot,street,city,state,zip_code,house_size,prev_sold_date
2226377,23009.0,sold,359900.0,4.0,2.0,0.33,353094.0,Richland,Washington,99354.0,3600.0,2022-03-25
2226378,18208.0,sold,350000.0,3.0,2.0,0.10,1062149.0,Richland,Washington,99354.0,1616.0,2022-03-25
2226379,76856.0,sold,440000.0,6.0,3.0,0.50,405677.0,Richland,Washington,99354.0,3200.0,2022-03-24
2226380,53618.0,sold,179900.0,2.0,1.0,0.09,761379.0,Richland,Washington,99354.0,933.0,2022-03-24
2226381,108243.0,sold,580000.0,5.0,3.0,0.31,307704.0,Richland,Washington,99354.0,3615.0,2022-03-23

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2226382 entries, 0 to 2226381
Data columns (total 12 columns):
 #   Column          Dtype
---  ------          -----
 0   brokered_by     float64
 1   status          object
 2   price           float64
 3   bed             float64
 4   bath            float64
 5   acre_lot        float64
 6   street          float64
 7   city            object
 8   state           object
 9   zip_code        float64
 10  house_size      float64
 11  prev_sold_date  object
dtypes: float64(8), object(4)
memory usage: 203.8+ MB

In [7]:
df.shape

(2226382, 12)

In [8]:
df.columns

Index(['brokered_by', 'status', 'price', 'bed', 'bath', 'acre_lot', 'street',
       'city', 'state', 'zip_code', 'house_size', 'prev_sold_date'],
      dtype='object')

In [9]:
df.describe()

,brokered_by,price,bed,bath,acre_lot,street,zip_code,house_size
count,2.221849e+06,2.224841e+06,1.745065e+06,1.714611e+06,1.900793e+06,2.215516e+06,2.226083e+06,1.657898e+06
mean,5.293989e+04,5.241955e+05,3.275841e+00,2.496440e+00,1.522303e+01,1.012325e+06,5.218668e+04,2.714471e+03
std,3.064275e+04,2.138893e+06,1.567274e+00,1.652573e+00,7.628238e+02,5.837635e+05,2.895408e+04,8.081635e+05
min,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,4.000000e+00
25%,2.386100e+04,1.650000e+05,3.000000e+00,2.000000e+00,1.500000e-01,5.063128e+05,2.961700e+04,1.300000e+03
50%,5.288400e+04,3.250000e+05,3.000000e+00,2.000000e+00,2.600000e-01,1.012766e+06,4.838200e+04,1.760000e+03
75%,7.918300e+04,5.500000e+05,4.000000e+00,3.000000e+00,9.800000e-01,1.521173e+06,7.807000e+04,2.413000e+03
max,1.101420e+05,2.147484e+09,4.730000e+02,8.300000e+02,1.000000e+05,2.001357e+06,9.999900e+04,1.040400e+09

In [10]:
# Check for missing values

df.isnull().sum()

brokered_by         4533
status                 0
price               1541
bed               481317
bath              511771
acre_lot          325589
street             10866
city                1407
state                  8
zip_code             299
house_size        568484
prev_sold_date    734297
dtype: int64

In [11]:
# Check unique states

print("Unique States:", df['state'].nunique())
print("States List:\n", df['state'].unique())

Unique States: 55
States List:
 ['Puerto Rico' 'Virgin Islands' 'Massachusetts' 'Connecticut'
 'New Hampshire' 'Vermont' 'New Jersey' 'New York' 'South Carolina'
 'Tennessee' 'Rhode Island' 'Virginia' 'Wyoming' 'Maine' 'Georgia'
 'Pennsylvania' 'West Virginia' 'Delaware' 'Louisiana' 'Ohio' 'California'
 'Colorado' 'Maryland' 'Missouri' 'District of Columbia' 'Wisconsin'
 'North Carolina' 'Kentucky' 'Michigan' 'Mississippi' 'Florida' 'Alabama'
 'New Brunswick' nan 'Texas' 'Arkansas' 'Idaho' 'Indiana' 'Illinois'
 'New Mexico' 'Iowa' 'Minnesota' 'South Dakota' 'Nebraska' 'North Dakota'
 'Montana' 'Oklahoma' 'Kansas' 'Oregon' 'Utah' 'Nevada' 'Washington'
 'Arizona' 'Hawaii' 'Guam' 'Alaska']

## Data Cleaning

In [13]:
# Convert zip_code and street to string (categorical)

df['zip_code'] = df['zip_code'].astype(str)
df['street'] = df['street'].astype(str)

In [14]:
# Drop rows with missing critical data or invalid zero values

df = df.dropna(subset=['price', 'bed', 'bath', 'state', 'brokered_by'])
df = df[(df['price'] > 0) & (df['bed'] > 0) & (df['bath'] > 0)]

In [15]:
# Drop irrelevant or too-missing columns

df.drop(columns=['prev_sold_date'], inplace=True)

In [16]:
# Convert house_size, acre_lot to numeric

df['house_size'] = pd.to_numeric(df['house_size'], errors='coerce')
df['acre_lot'] = pd.to_numeric(df['acre_lot'], errors='coerce')

In [17]:
# Final check

print("New shape after cleaning:", df.shape)
print(df.isnull().sum())

New shape after cleaning: (1701600, 11)
brokered_by         0
status              0
price               0
bed                 0
bath                0
acre_lot       271859
street              0
city              390
state               0
zip_code            0
house_size      98711
dtype: int64

In [18]:
# Drop missing city rows

df = df[df['city'].notnull()]

In [19]:
# Fill acre_lot missing with median

df['acre_lot'].fillna(df['acre_lot'].median(), inplace=True)

/var/folders/p5/vpnkknds53xft7m2vr4c0yg80000gn/T/ipykernel_16461/3680407774.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['acre_lot'].fillna(df['acre_lot'].median(), inplace=True)

In [20]:
# Fill house_size missing with median

df['house_size'].fillna(df['house_size'].median(), inplace=True)

/var/folders/p5/vpnkknds53xft7m2vr4c0yg80000gn/T/ipykernel_16461/2686867415.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['house_size'].fillna(df['house_size'].median(), inplace=True)

In [21]:
print("New shape after cleaning:", df.shape)
print(df.isnull().sum())

New shape after cleaning: (1701210, 11)
brokered_by    0
status         0
price          0
bed            0
bath           0
acre_lot       0
street         0
city           0
state          0
zip_code       0
house_size     0
dtype: int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1701210 entries, 0 to 2226381
Data columns (total 11 columns):
 #   Column       Dtype
---  ------       -----
 0   brokered_by  float64
 1   status       object
 2   price        float64
 3   bed          float64
 4   bath         float64
 5   acre_lot     float64
 6   street       object
 7   city         object
 8   state        object
 9   zip_code     object
 10  house_size   float64
dtypes: float64(6), object(5)
memory usage: 155.8+ MB

## Connect to SQLite

In [24]:
import sqlite3

# Connect to SQLite database
conn = sqlite3.connect("realtor.db")
cursor = conn.cursor()

## Store Raw Data in a Temporary Table

In [26]:
df.to_sql("realtor_raw", conn, if_exists="replace", index=False)

1701210

## Normalized Tables

In [28]:
cursor.executescript("""
DROP TABLE IF EXISTS Broker;
DROP TABLE IF EXISTS Location;
DROP TABLE IF EXISTS Listing;

CREATE TABLE Broker (
    broker_id REAL PRIMARY KEY
);

CREATE TABLE Location (
    location_id INTEGER PRIMARY KEY AUTOINCREMENT,
    street TEXT,
    city TEXT,
    state TEXT,
    zip_code TEXT
);

CREATE TABLE Listing (
    listing_id INTEGER PRIMARY KEY AUTOINCREMENT,
    broker_id REAL,
    location_id INTEGER,
    status TEXT,
    price REAL,
    bed REAL,
    bath REAL,
    acre_lot REAL,
    house_size REAL,
    FOREIGN KEY (broker_id) REFERENCES Broker(broker_id),
    FOREIGN KEY (location_id) REFERENCES Location(location_id)
);
""")

conn.commit()

## Insert Data

In [30]:
# Unique Brokers

cursor.execute("""
INSERT OR IGNORE INTO Broker (broker_id)
SELECT DISTINCT brokered_by
FROM realtor_raw
WHERE brokered_by IS NOT NULL;
""")

conn.commit()

In [31]:
# Unique Locations

cursor.execute("""
INSERT INTO Location (street, city, state, zip_code)
SELECT DISTINCT street, city, state, zip_code
FROM realtor_raw;
""")

conn.commit()

In [32]:
# Listings Table

cursor.execute("""
INSERT INTO Listing (broker_id, location_id, status, price, bed, bath, acre_lot, house_size)
SELECT 
    r.brokered_by,
    l.location_id,
    r.status,
    r.price,
    r.bed,
    r.bath,
    r.acre_lot,
    r.house_size
FROM realtor_raw r
JOIN Location l
ON  r.street = l.street
AND r.city = l.city
AND r.state = l.state
AND r.zip_code = l.zip_code;
""")

conn.commit()

In [33]:
print("Brokers:", pd.read_sql("SELECT COUNT(*) FROM Broker", conn))
print("Locations:", pd.read_sql("SELECT COUNT(*) FROM Location", conn))
print("Listings:", pd.read_sql("SELECT COUNT(*) FROM Listing", conn))

Brokers:    COUNT(*)
0    101937
Locations:    COUNT(*)
0   1582280
Listings:    COUNT(*)
0   1701210

## Checking Data in Tables

In [35]:
pd.read_sql("SELECT * FROM Listing LIMIT 10;", conn)

,listing_id,broker_id,location_id,status,price,bed,bath,acre_lot,house_size
0,1,103378.0,1,for_sale,105000.0,3.0,2.0,0.12,920.0
1,2,52707.0,2,for_sale,80000.0,4.0,2.0,0.08,1527.0
2,3,103379.0,3,for_sale,67000.0,2.0,1.0,0.15,748.0
3,4,31239.0,4,for_sale,145000.0,4.0,2.0,0.10,1800.0
4,5,34632.0,5,for_sale,65000.0,6.0,2.0,0.05,1748.0
5,6,103378.0,6,for_sale,179000.0,4.0,3.0,0.46,2520.0
6,7,1205.0,7,for_sale,50000.0,3.0,1.0,0.20,2040.0
7,8,50739.0,8,for_sale,71600.0,3.0,2.0,0.08,1050.0
8,9,81909.0,9,for_sale,100000.0,2.0,1.0,0.09,1092.0
9,10,65672.0,10,for_sale,300000.0,5.0,3.0,7.46,5403.0

In [36]:
pd.read_sql("SELECT * FROM Location LIMIT 10;", conn)

   location_id     street           city        state zip_code
0            1  1962661.0       Adjuntas  Puerto Rico    601.0
1            2  1902874.0       Adjuntas  Puerto Rico    601.0
2            3  1404990.0     Juana Diaz  Puerto Rico    795.0
3            4  1947675.0          Ponce  Puerto Rico    731.0
4            5   331151.0       Mayaguez  Puerto Rico    680.0
5            6  1850806.0  San Sebastian  Puerto Rico    612.0
6            7  1298094.0         Ciales  Puerto Rico    639.0
7            8  1048466.0          Ponce  Puerto Rico    731.0
8            9   734904.0          Ponce  Puerto Rico    730.0
9           10  1946226.0     Las Marias  Puerto Rico    670.0

In [37]:
pd.read_sql("SELECT * FROM Broker LIMIT 10;", conn)

   broker_id
0   103378.0
1    52707.0
2   103379.0
3    31239.0
4    34632.0
5     1205.0
6    50739.0
7    81909.0
8    65672.0
9    46019.0

## ER Diagram

In [70]:
from eralchemy import render_er

# Generate ER diagram from SQLite DB

render_er('sqlite:///realtor.db', '/Users/shraddhakakade/Documents/MSDS/Sem 3/ADT/Project/realtor_er_diagram.png')